'use strict';

// Используйте функции alert, confirm, prompt для общения с пользователем.
// Написать игровой бот.
// "Загадывание случайного числа от 1 до 100"
// Что должна делать программа:
// — спрашивает пользователя: "Угадай число от 1 до 100".
// — если пользовательское число больше, то бот выводит "Загаданное число меньше" и предлагает ввести новый вариант;
// — если пользовательское число меньше, то бот выводит "Загаданное число больше" и предлагает ввести новый вариант;
// — если пользователь ввел не число, то выводит сообщение "Введи число!" и предлагает ввести новый вариант;
// — если пользователь нажимает "Отмена", то игра заканчивается и выводится сообщение "Игра окончена".
// — если пользовательское число равно загаданному, то игра заканчивается и выводит сообщение "Поздравляю, Вы угадали!!!
// Программа должны быть выполнена с помощью рекурсии, без единого цикла.
// Загаданное число должно храниться «в замыкании»

const isNumber = function (value) {
  return !isNaN(parseFloat(value) && isFinite(value));
};

const getNumber = function () {
  let n = Math.floor(Math.random() * 100 + 1);
  console.log(n);

  let testNumber = function () {
    let userNumber = +prompt('Угадай число от 1 до 100');

    if (userNumber === null) {
      alert('Игра окончена');
    } else if (!isNumber(userNumber)) {
      alert('Введи число');
      testNumber();
    } else if (userNumber > n) {
      alert('Загаданное число меньше');
      testNumber();
    } else if (userNumber < n) {
      alert('Загаданное число больше');
      testNumber();
    } else if (userNumber === n) {
      let correctAnswer = confirm(
        'Поздравляю, Вы угадали! Хотели бы сыграть еще?'
      );
      if (correctAnswer) {
        getNumber();
      }
    }
  };

  testNumber();
};
getNumber();
